 clear all;
   clc;
   f=0e9:0.00075e9:80e9;%所观察的滤波器的频率响应范围,单位Hz，RF射频信号
   c=3e8;%光速
   u=0;
   D=17.9e-6; %单模光纤群速度色散系数，单位s/(m*m);
   L=5e3;%单位m;单模光纤的长度
   v1=0.3e-9;%波长间隔
%    v2=0.4e-9;%波长间隔
   lamda=1550e-9;%平均波长,单位m
   fsr=1/v1/D/L %20度时的FER
%    h=cos(pi*D*L*v^2.*f.^2/c+pi/2); 
   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %使用FD-OP滤除上边带时，控制抽头幅值，滤波器响应谱，除去sin函数对响应谱的影响  
   %抽头权重系数
   %%%%%%%%%%%%%%%%%%%%%%%%%  10-taps power>0  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
 a9=0.05;a8=0.1;a7=0.2;a6=0.3;a5=0.45;a4=0.6;a3=0.7;a2=0.8;a1=0.95;a0=4.15;
   N=1;
   u10=a0;
   u11=a1*exp(j*(f*2*pi)*N*1/2*v1*D*L);
   u12=a2*exp(j*(f*2*pi)*N*3/2*v1*D*L);
   u13=a3*exp(j*(f*2*pi)*N*5/2*v1*D*L);
   u14=a4*exp(j*(f*2*pi)*N*7/2*v1*D*L);
   u15=a5*exp(j*(f*2*pi)*N*9/2*v1*D*L);
   u16=a6*exp(j*(f*2*pi)*N*11/2*v1*D*L);
   u17=a7*exp(j*(f*2*pi)*N*13/2*v1*D*L);
   u18=a8*exp(j*(f*2*pi)*N*15/2*v1*D*L);
   u19=a9*exp(j*(f*2*pi)*N*17/2*v1*D*L);
%    u110=a10*exp(j*(f*2*pi)*9*v1*D*L);
%    u111=a11*exp(j*(f*2*pi)*10*v1*D*L);

   H2=u10+u11+u12+u13+u14+u15+u16+u17+u18+u19;
    L2=20*log10(abs(H2/5));
    %%%%%%%%%%%%%%%%%  10-taps power<0  %%%%%%%%%%%%%%%%%%%%%%%%
  a9_1=-0.1;a8_1=-0.2;a7_1=-0.4;a6_1=-0.8;a5_1=-1.1;a4_1=-1.5;a3_1=-1.7;a2_1=-2;a1_1=-2.2;a0_1=-10;
   u10_1=a0_1;
   u11_1=a1_1*exp(j*(f*2*pi)*N*1/2*v1*D*L);
   u12_1=a2_1*exp(j*(f*2*pi)*N*3/2*v1*D*L);
   u13_1=a3_1*exp(j*(f*2*pi)*N*5/2*v1*D*L);
   u14_1=a4_1*exp(j*(f*2*pi)*N*7/2*v1*D*L);
   u15_1=a5_1*exp(j*(f*2*pi)*N*9/2*v1*D*L);
   u16_1=a6_1*exp(j*(f*2*pi)*N*11/2*v1*D*L);
   u17_1=a7_1*exp(j*(f*2*pi)*N*13/2*v1*D*L);
   u18_1=a8_1*exp(j*(f*2*pi)*N*15/2*v1*D*L);
   u19_1=a9_1*exp(j*(f*2*pi)*N*17/2*v1*D*L);

   H2_1=u10_1+u11_1+u12_1+u13_1+u14_1+u15_1+u16_1+u17_1+u18_1+u19_1;
   L2_1=20*log10(abs(H2_1/150));
   plot(f/(1e9),L2,'r','LineWidth',1);
   hold on;
   plot(f/(1e9),L2_1,'--k','LineWidth',1);
   hold on;
   axis([0 75 -70 10]);%横纵坐标取值范围
   xlabel('Frequency(GHz)');%横坐标名称
   ylabel('Response(dB)');%纵坐标名称
   legend('10-taps power>0','10-taps power<0')
   
   