clear all;
   clc;
   f=0e9:0.00075e9:80e9;%所观察的滤波器的频率响应范围,单位Hz，RF射频信号
   c=3e8;%光速
   u=0;
   D=17.9e-6; %单模光纤群速度色散系数，单位s/(m*m);
   L=5e3;%单位m;单模光纤的长度
   v1=0.3e-9;%波长间隔
%    v2=0.4e-9;%波长间隔
   lamda=1550e-9;%平均波长,单位m
   fsr=1/v1/D/L %20度时的FER
    N=1;
%    h=cos(pi*D*L*v^2.*f.^2/c+pi/2); 
   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    %使用FD-OP滤除上边带时，控制抽头幅值，滤波器响应谱，除去sin函数对响应谱的影响  
   %抽头权重系数
   %%%%%%%%%%%%%%%%%%%%%%%  20抽头 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
   a19_20=-0.02;a18_20=-0.05;a17_20=-0.07;a16_20=-0.1;a15_20=-0.15;a14_20=-0.3;
   a13_20=-0.3; a12_20=-0.35;a11_20=-0.4;a10_20=-0.5;a9_20=-0.61;a8_20=-0.66;a7_20=-0.72;a6_20=-0.77;a5_20=-0.83;a4_20=0-0.89;a3_20=-0.94;a2_20=-1.11;a1_20=-1.33;a0_20=-10;
   u10_20=a0_20;
   u11_20=a1_20*exp(j*(f*2*pi)*N*1/2*v1*D*L);
   u12_20=a2_20*exp(j*(f*2*pi)*N*3/2*v1*D*L);
   u13_20=a3_20*exp(j*(f*2*pi)*N*5/2*v1*D*L);
   u14_20=a4_20*exp(j*(f*2*pi)*N*7/2*v1*D*L);
   u15_20=a5_20*exp(j*(f*2*pi)*N*9/2*v1*D*L);
   u16_20=a6_20*exp(j*(f*2*pi)*N*11/2*v1*D*L);
   u17_20=a7_20*exp(j*(f*2*pi)*N*13/2*v1*D*L);
   u18_20=a8_20*exp(j*(f*2*pi)*N*15/2*v1*D*L);
   u19_20=a9_20*exp(j*(f*2*pi)*N*17/2*v1*D*L);
   u110_20=a10_20*exp(j*(f*2*pi)*N*19/2*v1*D*L);
   u111_20=a11_20*exp(j*(f*2*pi)*N*21/2*v1*D*L);
   u112_20=a12_20*exp(j*(f*2*pi)*N*23/2*v1*D*L);
   u113_20=a13_20*exp(j*(f*2*pi)*N*25/2*v1*D*L);
   u114_20=a14_20*exp(j*(f*2*pi)*N*27/2*v1*D*L);
   u115_20=a15_20*exp(j*(f*2*pi)*N*29/2*v1*D*L);
   u116_20=a16_20*exp(j*(f*2*pi)*N*31/2*v1*D*L);
   u117_20=a17_20*exp(j*(f*2*pi)*N*33/2*v1*D*L);
   u118_20=a18_20*exp(j*(f*2*pi)*N*35/2*v1*D*L);
   u119_20=a19_20*exp(j*(f*2*pi)*N*37/2*v1*D*L);
   
   H2_20=u10_20+u11_20+u12_20+u13_20+u14_20+u15_20+u16_20+u17_20+u18_20+u19_20+u110_20+u111_20+u112_20+u113_20+u114_20+u115_20+u116_20+u117_20+u118_20+u119_20;
   L2_20=20*log10(abs(H2_20/100));
   plot(f/(1e9),L2_20,'b','LineWidth',1);
   hold on;
    axis([0 75 -60 10]);%横纵坐标取值范围
   xlabel('Frequency(GHz)');%横坐标名称
   ylabel('Response(dB)');%纵坐标名称
   legend('20-tops')
   